export const EquipmentKnot = [
  {
    id: 1,
    name: 'Электроснабжение'
  },
  {
    id: 2,
    name: 'Шатлл робота'
  },
  {
    id: 3,
    name: 'Установка обратного осмоса'
  },
  {
    id: 4,
    name: 'Установка насосная T-power'
  },
  {
    id: 5,
    name: 'Установка компрессорная'
  },
  {
    id: 6,
    name: 'Узел поста(бокс)'
  },
  {
    id: 7,
    name: 'Терминал'
  },
  {
    id: 8,
    name: 'Система умягчения воды'
  },
  {
    id: 9,
    name: 'Системы видеонаблюдения'
  },
  {
    id: 10,
    name: 'Рукомойник'
  },
  {
    id: 11,
    name: 'Робот'
  },
  {
    id: 12,
    name: 'Пылесос'
  },
  {
    id: 13,
    name: 'Отчетность'
  },
  {
    id: 14,
    name: 'Котельное оборудование'
  },
  {
    id: 15,
    name: 'Короб.крыша'
  },
  {
    id: 16,
    name: 'Инжекторный модуль Premium 3G'
  },
  {
    id: 17,
    name: 'Дозирующая установка Premium 4G'
  },
  {
    id: 18,
    name: 'Дозирующая установка Buisness'
  },
  {
    id: 19,
    name: 'Водоснабжение АМС'
  },
  {
    id: 20,
    name: 'АХО(хоз.деятельность)'
  },
  {
    id: 21,
    name: 'Америка Q1'
  },
  {
    id: 22,
    name: 'IT сеть'
  }
]