export const UserRoles = [
  {
    id: 1,
    name: 'Владелец кабинета',
    description: 'Владелец организации. Имеет полный доступ.',
    userPermissions: {
      connect: [
        {
          id: 2,
        },
        {
          id: 3,
        },
        {
          id: 4,
        },
        {
          id: 5,
        },
        {
          id: 7,
        },
        {
          id: 8,
        },
        {
          id: 9,
        },
        {
          id: 10,
        },
        {
          id: 12,
        },
        {
          id: 13,
        },
        {
          id: 14,
        },
        {
          id: 15,
        },
        {
          id: 17,
        },
        {
          id: 18,
        },
        {
          id: 19,
        },
        {
          id: 20,
        },
        {
          id: 22,
        },
        {
          id: 23,
        },
        {
          id: 24,
        },
        {
          id: 25,
        },
        {
          id: 27,
        },
        {
          id: 28,
        },
        {
          id: 29,
        },
        {
          id: 30,
        },
        {
          id: 32,
        },
        {
          id: 33,
        },
        {
          id: 34,
        },
        {
          id: 35,
        },
        {
          id: 37,
        },
        {
          id: 38,
        },
        {
          id: 39,
        },
        {
          id: 40,
        },
        {
          id: 42,
        },
        {
          id: 43,
        },
        {
          id: 44,
        },
        {
          id: 45,
        },
        {
          id: 47,
        },
        {
          id: 48,
        },
        {
          id: 49,
        },
        {
          id: 50,
        },
      ],
    },
  },
  {
    id: 2,
    name: 'Администратор кабинета',
    description:
      'Администратор организации. Имеет полный доступ, помимо создания и закрытия организации.',
    userPermissions: {
      connect: [
        {
          id: 3,
        },
        {
          id: 7,
        },
        {
          id: 8,
        },
        {
          id: 9,
        },
        {
          id: 10,
        },
        {
          id: 12,
        },
        {
          id: 13,
        },
        {
          id: 14,
        },
        {
          id: 15,
        },
        {
          id: 17,
        },
        {
          id: 18,
        },
        {
          id: 19,
        },
        {
          id: 20,
        },
        {
          id: 22,
        },
        {
          id: 23,
        },
        {
          id: 24,
        },
        {
          id: 25,
        },
        {
          id: 27,
        },
        {
          id: 28,
        },
        {
          id: 29,
        },
        {
          id: 30,
        },
        {
          id: 32,
        },
        {
          id: 33,
        },
        {
          id: 34,
        },
        {
          id: 35,
        },
        {
          id: 37,
        },
        {
          id: 38,
        },
        {
          id: 39,
        },
        {
          id: 40,
        },
        {
          id: 42,
        },
        {
          id: 43,
        },
        {
          id: 44,
        },
        {
          id: 45,
        },
        {
          id: 47,
        },
        {
          id: 48,
        },
        {
          id: 49,
        },
        {
          id: 50,
        },
      ],
    },
  },
  {
    id: 3,
    name: 'Менеджер кабинета',
    description:
      'Главный менеджер. Имеет полный доступ к управлению объектами и складами. Также может просматривать информацию по оборудованию.',
    userPermissions: {
      connect: [
        {
          id: 9,
        },
        {
          id: 14,
        },
        {
          id: 17,
        },
        {
          id: 18,
        },
        {
          id: 19,
        },
        {
          id: 20,
        },
        {
          id: 22,
        },
        {
          id: 23,
        },
        {
          id: 24,
        },
        {
          id: 25,
        },
        {
          id: 27,
        },
        {
          id: 28,
        },
        {
          id: 29,
        },
        {
          id: 32,
        },
        {
          id: 33,
        },
        {
          id: 34,
        },
        {
          id: 46,
        },
      ],
    },
  },
  {
    id: 4,
    name: 'Менеджер объекта',
    description:
      'Менеджер по конкретным объектам. Имеет возможность заполнять формы по управлению объектами, смотреть информацию по складам и проводить документы.',
    userPermissions: {
      connect: [
        {
          id: 9,
        },
        {
          id: 19,
        },
        {
          id: 22,
        },
        {
          id: 24,
        },
        {
          id: 27,
        },
        {
          id: 29,
        },
        {
          id: 32,
        },
        {
          id: 34,
        },
        {
          id: 47,
        },
        {
          id: 48,
        },
        {
          id: 49,
        },
        {
          id: 50,
        },
      ],
    },
  },
  {
    id: 5,
    name: 'Техник кабинета',
    description:
      'Главный техник. Имеет полный доступ к управлению оборудованием и складами. Также может просматривать информацию по управлению.',
    userPermissions: {
      connect: [
        {
          id: 12,
        },
        {
          id: 13,
        },
        {
          id: 14,
        },
        {
          id: 17,
        },
        {
          id: 18,
        },
        {
          id: 19,
        },
        {
          id: 20,
        },
        {
          id: 22,
        },
        {
          id: 23,
        },
        {
          id: 24,
        },
        {
          id: 25,
        },
        {
          id: 29,
        },
        {
          id: 34,
        },
        {
          id: 49,
        },
      ],
    },
  },
  {
    id: 6,
    name: 'Техник объекта',
    description:
      'Техник по конкретным объектам. Имеет возможность заполнять формы по оборудованию, смотреть информацию по складам и проводить документы.',
    userPermissions: {
      connect: [
        {
          id: 12,
        },
        {
          id: 13,
        },
        {
          id: 14,
        },
        {
          id: 17,
        },
        {
          id: 19,
        },
        {
          id: 22,
        },
        {
          id: 24,
        },
      ],
    },
  },
  {
    id: 7,
    name: 'Техно-менеджер',
    description: 'Совмещает в себе техника и менеджера объекта.',
    userPermissions: {
      connect: [
        {
          id: 9,
        },
        {
          id: 12,
        },
        {
          id: 13,
        },
        {
          id: 14,
        },
        {
          id: 17,
        },
        {
          id: 19,
        },
        {
          id: 22,
        },
        {
          id: 24,
        },
        {
          id: 27,
        },
        {
          id: 29,
        },
        {
          id: 47,
        },
        {
          id: 48,
        },
        {
          id: 49,
        },
        {
          id: 50,
        },
      ],
    },
  },
  {
    id: 8,
    name: 'Бухгалтер',
    description: 'Имеет полный доступ к управлению, HR и аналитике',
    userPermissions: {
      connect: [
        {
          id: 9,
        },
        {
          id: 22,
        },
        {
          id: 23,
        },
        {
          id: 24,
        },
        {
          id: 25,
        },
        {
          id: 27,
        },
        {
          id: 29,
        },
        {
          id: 42,
        },
        {
          id: 43,
        },
        {
          id: 44,
        },
        {
          id: 46,
        },
      ],
    },
  },
  {
    id: 9,
    name: 'Маркетолог',
    description: 'Имеет полный доступ к программе лояльности и аналитике.',
    userPermissions: {
      connect: [
        {
          id: 9,
        },
        {
          id: 36,
        },
        {
          id: 37,
        },
        {
          id: 38,
        },
        {
          id: 39,
        },
        {
          id: 40,
        },
      ],
    },
  },
  {
    id: 10,
    name: 'Разработчик',
    description: 'Имеет абослютные права.',
    userPermissions: {
      connect: [
        {
          id: 1,
        },
        {
          id: 6,
        },
        {
          id: 11,
        },
        {
          id: 16,
        },
        {
          id: 21,
        },
        {
          id: 26,
        },
        {
          id: 31,
        },
        {
          id: 36,
        },
        {
          id: 41,
        },
        {
          id: 46,
        },
      ],
    },
  },
];
